; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-3-5-1-5-13)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos0-4 pos1-0 pos1-1 pos1-2 pos1-3 pos1-4 pos2-0 pos2-1 pos2-2 pos2-3 pos2-4
    shape0
    key0 key1 key2 key3 key4
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos0-3)
       (place pos0-4)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos1-3)
       (place pos1-4)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (place pos2-3)
       (place pos2-4)
       (shape shape0)
       (key key0)
       (key key1)
       (key key2)
       (key key3)
       (key key4)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-3)
       (conn pos0-2 pos0-1)
       (conn pos0-3 pos1-3)
       (conn pos0-3 pos0-4)
       (conn pos0-3 pos0-2)
       (conn pos0-4 pos1-4)
       (conn pos0-4 pos0-3)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos1-3)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos1-3 pos2-3)
       (conn pos1-3 pos1-4)
       (conn pos1-3 pos0-3)
       (conn pos1-3 pos1-2)
       (conn pos1-4 pos2-4)
       (conn pos1-4 pos0-4)
       (conn pos1-4 pos1-3)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos2-3)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (conn pos2-3 pos2-4)
       (conn pos2-3 pos1-3)
       (conn pos2-3 pos2-2)
       (conn pos2-4 pos1-4)
       (conn pos2-4 pos2-3)
       (locked pos0-4)
       (locked pos2-4)
       (locked pos1-3)
       (locked pos2-2)
       (locked pos0-0)
       (locked pos2-1)
       (locked pos2-0)
       (locked pos1-2)
       (locked pos1-1)
       (locked pos0-2)
       (locked pos1-4)
       (locked pos2-3)
       (locked pos0-3)
       (lock-shape  pos0-4 shape0)
       (lock-shape  pos2-4 shape0)
       (lock-shape  pos1-3 shape0)
       (lock-shape  pos2-2 shape0)
       (lock-shape  pos0-0 shape0)
       (lock-shape  pos2-1 shape0)
       (lock-shape  pos2-0 shape0)
       (lock-shape  pos1-2 shape0)
       (lock-shape  pos1-1 shape0)
       (lock-shape  pos0-2 shape0)
       (lock-shape  pos1-4 shape0)
       (lock-shape  pos2-3 shape0)
       (lock-shape  pos0-3 shape0)
       (open pos0-1)
       (open pos1-0)

       (key-shape  key0 shape0)
       (key-shape  key1 shape0)
       (key-shape  key2 shape0)
       (key-shape  key3 shape0)
       (key-shape  key4 shape0)
       (at key0 pos2-4)
       (at key1 pos2-0)
       (at key2 pos1-0)
       (at key3 pos2-2)
       (at key4 pos1-2)
       (at-robot pos1-0)
    )

    (:goal (and
       (at key0 pos2-1)
       (at key2 pos0-0)
       (at key3 pos0-3)
    )))

; plan
1. (pickup pos1-0 key2)
   deleted: (at key2 pos1-0) (arm-empty)
   added: (holding key2)
   goals met: 0 of 3
2. (unlock pos1-0 pos2-0 key2 shape0)
   deleted: (locked pos2-0)
   added: (open pos2-0)
   goals met: 0 of 3
3. (unlock pos1-0 pos0-0 key2 shape0)
   deleted: (locked pos0-0)
   added: (open pos0-0)
   goals met: 0 of 3
4. (move pos1-0 pos0-0)
   deleted: (at-robot pos1-0)
   added: (at-robot pos0-0)
   goals met: 0 of 3
5. (putdown pos0-0 key2)
   deleted: (holding key2)
   added: (arm-empty) (at key2 pos0-0)
   goals met: 1 of 3
6. (move pos0-0 pos1-0)
   deleted: (at-robot pos0-0)
   added: (at-robot pos1-0)
   goals met: 1 of 3
7. (move pos1-0 pos2-0)
   deleted: (at-robot pos1-0)
   added: (at-robot pos2-0)
   goals met: 1 of 3
8. (pickup pos2-0 key1)
   deleted: (at key1 pos2-0) (arm-empty)
   added: (holding key1)
   goals met: 1 of 3
9. (unlock pos2-0 pos2-1 key1 shape0)
   deleted: (locked pos2-1)
   added: (open pos2-1)
   goals met: 1 of 3
10. (move pos2-0 pos2-1)
   deleted: (at-robot pos2-0)
   added: (at-robot pos2-1)
   goals met: 1 of 3
11. (unlock pos2-1 pos2-2 key1 shape0)
   deleted: (locked pos2-2)
   added: (open pos2-2)
   goals met: 1 of 3
12. (move pos2-1 pos2-2)
   deleted: (at-robot pos2-1)
   added: (at-robot pos2-2)
   goals met: 1 of 3
13. (unlock pos2-2 pos2-3 key1 shape0)
   deleted: (locked pos2-3)
   added: (open pos2-3)
   goals met: 1 of 3
14. (move pos2-2 pos2-3)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-3)
   goals met: 1 of 3
15. (unlock pos2-3 pos2-4 key1 shape0)
   deleted: (locked pos2-4)
   added: (open pos2-4)
   goals met: 1 of 3
16. (move pos2-3 pos2-4)
   deleted: (at-robot pos2-3)
   added: (at-robot pos2-4)
   goals met: 1 of 3
17. (pickup-and-loose pos2-4 key0 key1)
   deleted: (holding key1) (at key0 pos2-4)
   added: (holding key0) (at key1 pos2-4)
   goals met: 1 of 3
18. (move pos2-4 pos2-3)
   deleted: (at-robot pos2-4)
   added: (at-robot pos2-3)
   goals met: 1 of 3
19. (move pos2-3 pos2-2)
   deleted: (at-robot pos2-3)
   added: (at-robot pos2-2)
   goals met: 1 of 3
20. (move pos2-2 pos2-1)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-1)
   goals met: 1 of 3
21. (putdown pos2-1 key0)
   deleted: (holding key0)
   added: (arm-empty) (at key0 pos2-1)
   goals met: 2 of 3
22. (move pos2-1 pos2-2)
   deleted: (at-robot pos2-1)
   added: (at-robot pos2-2)
   goals met: 2 of 3
23. (pickup pos2-2 key3)
   deleted: (at key3 pos2-2) (arm-empty)
   added: (holding key3)
   goals met: 2 of 3
24. (move pos2-2 pos2-3)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-3)
   goals met: 2 of 3
25. (unlock pos2-3 pos1-3 key3 shape0)
   deleted: (locked pos1-3)
   added: (open pos1-3)
   goals met: 2 of 3
26. (move pos2-3 pos1-3)
   deleted: (at-robot pos2-3)
   added: (at-robot pos1-3)
   goals met: 2 of 3
27. (unlock pos1-3 pos0-3 key3 shape0)
   deleted: (locked pos0-3)
   added: (open pos0-3)
   goals met: 2 of 3
28. (move pos1-3 pos0-3)
   deleted: (at-robot pos1-3)
   added: (at-robot pos0-3)
   goals met: 2 of 3
29. (putdown pos0-3 key3)
   deleted: (holding key3)
   added: (arm-empty) (at key3 pos0-3)
   goals met: 3 of 3
